/**
 * 配置同辈同色的颜色
 * */

module.exports = {
  // 每一个辈分对应的颜色
  color: {
    '9': '#03004c', // 鼻祖
    '8': '#00479d', // 元祖
    '7': '#00a0e9', // 太祖
    '6': '#e60012', // 烈祖
    '5': '#e5004f', // 天祖
    '4': '#920783', // 高祖
    '3': '#00561f', // 曾祖
    '2': '#638c0b', // 祖父
    '1': '#8fc31f', // 父亲
    '0': '#cac01c', // 自己所处的辈分
    '-1': '#f39800', // 儿子
    '-2': '#ef5011', // 孙子
    '-3': '#00ff00', // 曾孙
    '-4': '#e118cb', // 玄孙
    '-5': '#55a6ff', // 来孙
    '-6': '#1f31d9', // 晜孙
    '-7': '#13c0da', // 仍孙
    '-8': '#00f3d9', // 云孙
    '-9': '#06dda3' // 耳孙
  },
  // 计算规则
  // f:父,m:母,h:夫,w:妻,s:子,d:女
  // 规定计算规则,
  calRule: {
    f: {
      x: '-',
      y: '+',
      cy: '-',
      // rotate: [210, 270]
      rotate: [240, 240]
    },
    m: {
      x: '+',
      y: '+',
      cy: '-',
      // rotate: [270, 330],
      rotate: [300, 300]
    },
    h: {
      x: '-',
      y: 0,
      cy: 0,
      // rotate: [150, 210]
      rotate: [180, 180]
    },
    w: {
      x: '+',
      y: 0,
      cy: 0,
      rotate: [-30, 30]
    //   rotate: [0, 0]
    },
    s: {
      x: '-',
      y: '-',
      cy: '+',
      // rotate: [90, 150]
      rotate: [120, 120]
    },
    d: {
      x: '+',
      y: '-',
      cy: '+',
      // rotate: [30, 90]
      rotate: [60, 60]
    },
    dr: {
      x: '+',
      y: 0,
      cy: 0,
      // rotate: [150, 210]
      rotate: [330, 370]
    },
    sp: {
      x: '+',
      y: 0,
      cy: 0,
      // rotate: [150, 210]
      rotate: [0, 0]
    }
  },
  // 节点缩放的时候的缩放比例
  scaleNum: 0.6
}
